reactjs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-24 Fri 19:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org09b8b3c">1. React</a>
<ul>
<li><a href="#orgda8c5db">1.1. Object Destructuring</a></li>
<li><a href="#orga3f2f23">1.2. Rendering Arrays</a></li>
<li><a href="#orgfb017d2">1.3. Promises</a></li>
<li><a href="#org4e88392">1.4. Effect-hooks</a></li>
<li><a href="#orgf61d093">1.5. Initializing data from API</a></li>
<li><a href="#orgbcb1f82">1.6. Unit Testing</a></li>
<li><a href="#orgdca76e1">1.7. Handling Click Handlers</a></li>
<li><a href="#org4034ca1">1.8. Test Coverage</a></li>
<li><a href="#orgbb28cf8">1.9. Absolute imports in react</a></li>
<li><a href="#org2f9c3d5">1.10. Next.JS</a></li>
<li><a href="#orgf3967a3">1.11. Conference</a></li>
<li><a href="#org748766a">1.12. Confifuring JEST For ESM Modules based repos</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org09b8b3c" class="outline-2">
<h2 id="org09b8b3c"><span class="section-number-2">1.</span> React</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgda8c5db" class="outline-3">
<h3 id="orgda8c5db"><span class="section-number-3">1.1.</span> Object Destructuring</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-javascript">
// in react components props can be destructured at method parameter level
// React component names must be capitalized.
const GreetingMessage  = ({message, from}) =&gt;  {

    return (
	&lt;div&gt;
	    &lt;h3&gt;{from}&lt;/h3&gt;
	    &lt;p&gt;{message}&lt;/p&gt;
	&lt;/div&gt;
    )

}
export default GreetingMessage;

</pre>
</div>
</div>
</div>

<div id="outline-container-orga3f2f23" class="outline-3">
<h3 id="orga3f2f23"><span class="section-number-3">1.2.</span> Rendering Arrays</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-javascript">
&lt;ul&gt;
  {notes.map((note, i) =&gt;
    &lt;li key={i}&gt;
      {note.content}
    &lt;/li&gt;
  )}
&lt;/ul&gt;
// not recommended and can create undesired problems
// even if it seems to be working just fine.
// use id of entities

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb017d2" class="outline-3">
<h3 id="orgfb017d2"><span class="section-number-3">1.3.</span> Promises</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b><b>The promise is pending: It means that the final value (one of the following two) is not available yet.</b></b>
</p>

<p>
<b><b>The promise is fulfilled: It means that the operation has completed and the final value is available, which generally is a successful operation. This state is sometimes also called resolved.</b></b>
</p>

<p>
<b><b>The promise is rejected: It means that an error prevented the final value from being determined, which generally represents a failed operation.</b></b>
</p>
</div>
</div>

<div id="outline-container-org4e88392" class="outline-3">
<h3 id="org4e88392"><span class="section-number-3">1.4.</span> Effect-hooks</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b><b>We have already used [state hooks](<a href="https://reactjs.org/docs/hooks-state.html">https://reactjs.org/docs/hooks-state.html</a>) that were introduced along with React version [16.8.0](<a href="https://www.npmjs.com/package/react/v/16.8.0">https://www.npmjs.com/package/react/v/16.8.0</a>), which provide state to React components defined as functions - the so-called functional components. Version 16.8.0 also introduces the [effect hooks](<a href="https://reactjs.org/docs/hooks-effect.html">https://reactjs.org/docs/hooks-effect.html</a>) as a new feature. As per the official docs:</b></b>
</p>

<p>
&gt; The Effect Hook lets you perform side effects in function components. Data fetching, setting up a subscription, and manually changing the DOM in React components are all examples of side effects.
</p>

<div class="org-src-container">
<pre class="src src-javascript">
import React, { useState, useEffect } from 'react'
import axios from 'axios'
import Note from './components/Note'

const App = () =&gt; {
  const [notes, setNotes] = useState([])
  const [newNote, setNewNote] = useState('')
  const [showAll, setShowAll] = useState(true)

	useEffect(() =&gt; {
    console.log('effect')
    axios
      .get('http://localhost:3001/notes')
      .then(response =&gt; {
	console.log('promise fulfilled')
	setNotes(response.data)
      })
  }, [])
  console.log('render', notes.length, 'notes')
	// ...
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf61d093" class="outline-3">
<h3 id="orgf61d093"><span class="section-number-3">1.5.</span> Initializing data from API</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-javascript">// your action.js file
/// //////////////////////
export const initializeNotes = () =&gt; {
  return async dispatch =&gt; {
    const notes = await noteService.getAll()
    dispatch({
      type: 'INIT_NOTES',
      data: notes,
    })
  }
}

export const createNote = content =&gt; {
  return async dispatch =&gt; {
    const newNote = await noteService.createNew(content)
    dispatch({
      type: 'NEW_NOTE',
      data: newNote,
    })
  }
}

// component file
//////////////////
useEffect(() =&gt; {
    dispatch(initializeNotes())
  },[dispatch])


</pre>
</div>

<p>
props.children
</p>
</div>
</div>

<div id="outline-container-orgbcb1f82" class="outline-3">
<h3 id="orgbcb1f82"><span class="section-number-3">1.6.</span> Unit Testing</h3>
<div class="outline-text-3" id="text-1-6">
<p>
[Organizing Tests in Jest](<a href="https://medium.com/@JeffLombardJr/organizing-tests-in-jest-17fc431ff850">https://medium.com/@JeffLombardJr/organizing-tests-in-jest-17fc431ff850</a>)
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install --save-dev @testing-library/react @testing-library/jest-dom
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js">
import { render } from "@testing-library/react";
import Chat from "./chat";

test('should render person and image of chat', () =&gt; {

    const person = {"id": 1, "person": "about",
	"imageSrc": "https://static.thenounproject.com/png/2940537-200.png"};

    const chatComponent = render(&lt;Chat person={person.person} imageSrc={person.imageSrc}
	onClick={() =&gt; console.log('hello')} /&gt;);

    const personName = chatComponent.container.querySelector(".person-name");

    expect(personName).toHaveTextContent('about');


})

</pre>
</div>
</div>
</div>

<div id="outline-container-orgdca76e1" class="outline-3">
<h3 id="orgdca76e1"><span class="section-number-3">1.7.</span> Handling Click Handlers</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-js">
import { render, fireEvent } from "@testing-library/react";

test('should have click handler called upon clicking', () =&gt; {

		// arrange
    const person = {"id": 1, "person": "about",
	"imageSrc": "https://static.thenounproject.com/png/2940537-200.png"};


    const mockHandler = jest.fn();
    const chatComponent = render(&lt;Chat person={person.person} imageSrc={person.imageSrc}
	onClick={mockHandler} /&gt;);


	  // act
		const personName = chatComponent.container.querySelector(".person-name");
		fireEvent.click(personName);

		// assert
    expect(mockHandler.mock.calls).toHaveLength(1);

})
</pre>
</div>
</div>
</div>

<div id="outline-container-org4034ca1" class="outline-3">
<h3 id="org4034ca1"><span class="section-number-3">1.8.</span> Test Coverage</h3>
<div class="outline-text-3" id="text-1-8">
<p>
CI=true npm test &#x2013; &#x2013;coverage
</p>

<p>
## E2E Testing using Cypress
</p>

<p>
```jsx
npm install &#x2013;save-dev cypress
npm install eslint-plugin-cypress &#x2013;save-dev
</p>

<p>
npm run cypress:open
</p>

<p>
```
</p>

<p>
```jsx
describe('app', function() {
</p>

<p>
it('front page can be opened', function() {
  <b><b>cy.visit('http://localhost:3000')
  cy.contains('subham')</b></b>
  cy.contains('Hello Everyone')
})
</p>

<p>
it('checking button clicked ', function() {
  cy.visit('http://localhost:3000')
  <b><b>cy.get('#clicker').click()</b></b>
  cy.contains('button clicked')
</p>

<p>
})
</p>

<p>
it('filling form', function() {
   cy.visit('http://localhost:3000')
   <b><b>cy.get('input').type('hello world from cypress')</b></b>
</p>

<p>
})
</p>

<p>
})
</p>

<p>
```
</p>

<p>
```jsx
cy.request('POST', 'http://localhost:3001/api/login', {
      username: 'mluukkai', password: 'salainen'
    }).then(response =&gt; {
      localStorage.setItem('loggedNoteappUser', JSON.stringify(response.body))
      cy.visit('http://localhost:3000')
    })
```
</p>

<p>
```jsx
debugger()
```
</p>

<p>
running cypress from cli
</p>

<p>
<b><b>`"test:e2e": "cypress run"`</b></b>
</p>

<p>
## State management with Redux
</p>

<p>
[Fullstack part6 |](<a href="https://fullstackopen.com/en/part6/flux_architecture_and_redux">https://fullstackopen.com/en/part6/flux_architecture_and_redux</a>)
</p>

<p>
[Fundamentals of Redux Course from Dan Abramov](<a href="https://egghead.io/courses/fundamentals-of-redux-course-from-dan-abramov-bd5cc867">https://egghead.io/courses/fundamentals-of-redux-course-from-dan-abramov-bd5cc867</a>)
</p>

<p>
## PropTypes
</p>

<p>
to enforce type to components which will be passed in props PropTypes package can be used.
</p>

<p>
```jsx
import PropTypes from 'prop-types'
</p>

<p>
const LoginForm = ({
   handleSubmit,
   handleUsernameChange,
   handlePasswordChange,
   username,
   password
  }) =&gt; {
    // &#x2026;
  }
</p>

<p>
LoginForm.propTypes = {
  handleSubmit: PropTypes.func.isRequired,
  handleUsernameChange: PropTypes.func.isRequired,
  handlePasswordChange: PropTypes.func.isRequired,
  username: PropTypes.string.isRequired,
  password: PropTypes.string.isRequired
}
```
</p>

<p>
## Testing React apps
</p>

<p>
Mocking module functions
</p>

<p>
```bash
import { shuffleVert } from 'matrix';
const shuffleVertRef = {
    shuffleVert
};
let spyShuffleVert;
</p>

<p>
beforeEach(() =&gt; {
    spyShuffleVert = jest.spyOn(shuffleVertRef, "shuffleVert");
}
</p>

<p>
afterEach(() =&gt; {
    jest.clearAllMocks();
}
</p>

<p>
it('should shuffle the rows of the entire matrix with no argument for columns', () = {
    let srcMatrix = [
        { number: 1, word: 'one' },
        { number: 2, word: 'two' },
        { number: 3, word: 'three' }
    ];
</p>

<p>
    shuffleVert(srcMatrix);
    expect(spyShuffleVert).toHaveBeenCalledTimes(2);
}
```
</p>

<p>
## react hooks
</p>

<p>
[React Hooks Tutorial](<a href="https://www.robinwieruch.de/react-hooks">https://www.robinwieruch.de/react-hooks</a>)
</p>

<p>
React-router-Dom
</p>

<p>
Redux
</p>

<p>
React-Redux
</p>

<p>
Jest
</p>

<p>
## Gatsby
</p>

<p>
```bash
npm install -g gatsby-cli
gatsby new portfolio
</p>

<p>
```
</p>

<p>
gastsy-link → for link
</p>

<p>
react-helmet → for head info
</p>

<p>
```bash
gastsy develop
</p>

<p>
```
</p>


<div class="org-src-container">
<pre class="src src-js">
export const redirectTo404 = (locale = 'en-sg') =&gt; {
  window.location = `${window.location.origin}/${locale}/404`
}

import { redirectTo404 } from 'utils/redirectTo404'

describe('redirectTo404', () =&gt; {
  global.window = Object.create(window)
  const url = 'http://localhost/'
  Object.defineProperty(window, 'location', {
    value: {
      origin: url
    },
    writable: true
  })
  test('should redirect', () =&gt; {
    expect(window.location.origin).toBe('http://localhost/')
    redirectTo404('en-sg')
    expect(window.location).toBe('http://localhost//en-sg/404')
  })
})

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb28cf8" class="outline-3">
<h3 id="orgbb28cf8"><span class="section-number-3">1.9.</span> Absolute imports in react</h3>
<div class="outline-text-3" id="text-1-9">
<p>
[Absolute imports with Create React App](<a href="https://medium.com/hackernoon/absolute-imports-with-create-react-app-4c6cfb66c35d">https://medium.com/hackernoon/absolute-imports-with-create-react-app-4c6cfb66c35d</a>)
</p>
</div>
</div>

<div id="outline-container-org2f9c3d5" class="outline-3">
<h3 id="org2f9c3d5"><span class="section-number-3">1.10.</span> Next.JS</h3>
<div class="outline-text-3" id="text-1-10">
<p>
[Lee Robinson - Developer, writer, creator.](<a href="https://leerob.io/">https://leerob.io/</a>)
</p>

<p>
[<a href="https://www.youtube.com/watch?v=mTz0GXj8NN0">https://www.youtube.com/watch?v=mTz0GXj8NN0</a>](<a href="https://www.youtube.com/watch?v=mTz0GXj8NN0">https://www.youtube.com/watch?v=mTz0GXj8NN0</a>)
</p>
</div>
</div>

<div id="outline-container-orgf3967a3" class="outline-3">
<h3 id="orgf3967a3"><span class="section-number-3">1.11.</span> Conference</h3>
<div class="outline-text-3" id="text-1-11">
<p>
[Conferences - React](<a href="https://reactjs.org/community/conferences.html">https://reactjs.org/community/conferences.html</a>)
</p>

<p>
[<a href="https://conf.reactjs.org/stage">https://conf.reactjs.org/stage</a>](<a href="https://conf.reactjs.org/stage">https://conf.reactjs.org/stage</a>)
</p>
</div>
</div>

<div id="outline-container-org748766a" class="outline-3">
<h3 id="org748766a"><span class="section-number-3">1.12.</span> Confifuring JEST For ESM Modules based repos</h3>
<div class="outline-text-3" id="text-1-12">
<p>
configure jest for you Node.js backend project, lambdas for ESM based repos
</p>

<ol class="org-ol">
<li>Installation</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash">npm install jest
</pre>
</div>

<ol class="org-ol">
<li>setting up jest.config.json</li>
</ol>

<div class="org-src-container">
<pre class="src src-json">{
    "transform": {}
}
</pre>
</div>

<p>
this will not transform your source code which is helpful if you are mocking your dependencies while writing unit tests. <a href="https://stackoverflow.com/questions/64582674/jest-mock-of-es6-class-yields-referenceerror-require-is-not-defined">https://stackoverflow.com/questions/64582674/jest-mock-of-es6-class-yields-referenceerror-require-is-not-defined</a>
</p>

<ol class="org-ol">
<li>Test Scripts</li>
</ol>

<div class="org-src-container">
<pre class="src src-bash">
{
"scripts": {
    "test-watch": "node --experimental-vm-modules node_modules/jest/bin/jest.js --watch",
    "test": "node --experimental-vm-modules node_modules/jest/bin/jest.js",
}
</pre>
</div>

<p>
Why &#x2013;experimental-vm-modules?
[Official Doc](<a href="https://jestjs.io/docs/ecmascript-modules">https://jestjs.io/docs/ecmascript-modules</a>)
</p>

<ol class="org-ol">
<li>Testing specific files</li>
</ol>

<p>
```bash
npm run test-watch src/get-file/index.test.js
```
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-24 Fri 19:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
